the_final_folder/website/app/views/domains/show.html.erb

  <%= @domain.name %> <br />
  <% @domain.servers.each do |serv| %>
---
SELECT "servers".* FROM "servers" WHERE "servers"."domain_id" = 1