the_final_folder/website/app/controllers/domains_controller.rb

  def index
    @domains = Domain.all
---
SELECT "domains".* FROM "domains"

  def show
    @domain = Domain.find(params[:id])
---
SELECT "domains".* FROM "domains" WHERE "domains"."id" = 1 LIMIT 1

  def create
    @domain = Domain.new(params[:domain])

    respond_to do |format|
      if @domain.save
---
INSERT INTO "domains" ("created_at", "name", "updated_at") VALUES ('2012-12-09 22:42:38.006000', 'localhost', '2012-12-09 22:42:38.006000')