the_final_folder/website/app/controllers/files_controller.rb

SELECT "domains".* FROM "domains" WHERE "domains"."name" = 'localhost' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."remember_token" = 'teamA' LIMIT 1
SELECT "servers".* FROM "servers" WHERE "servers"."domain_id" = 1
---
	def ls
		domain = Domain.find_by_name(params[:domain])
		user = User.find_by_remember_token(cookies[:remember_token]);
		redirect_to '/signin' and return if user.nil?
		puts ">>>>>>>>>>>>>Contains cd: #{params[:cd]} and is #{params[:cd]} : #{params[:cd] == "down"}"
		if(params[:cd] == "up" || params[:cd] == "down")
			cdir = cookies[:directory]
			cdir = Pathname.new(cdir + "/").parent.to_str if params[:cd] == "up"
			cdir = (Pathname.new(cdir) + params[:id]).to_str if params[:cd] == "down"
			cookies.permanent[:directory] = cdir
			redirect_to "/files/" + domain.name
			return
		end
		@domain_name = domain.name
		target_directory = cookies[:directory];
		if target_directory.nil? || target_directory == 'null' || target_directory.empty?
			target_directory = "/"
		else
			target_directory = "/" + target_directory
		end
		puts "================== Initializing Client: #{user.name} :: #{target_directory.inspect} =========================="
		server_list = []
		domain.servers.each do |serv|

SELECT "domains".* FROM "domains" WHERE "domains"."name" = 'localhost' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."remember_token" = 'teamA' LIMIT 1
SELECT "servers".* FROM "servers" WHERE "servers"."domain_id" = 1
---
	def get_file
		domain = Domain.find_by_name(params[:domain])
		user = User.find_by_remember_token(cookies[:remember_token]);
                redirect_to '/signin' and return if user.nil?
		@target_file = cookies[:directory] + '/' + params[:id]
		server_list = []
		domain.servers.each do |serv|

SELECT "domains".* FROM "domains" WHERE "domains"."name" = 'localhost' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."remember_token" = 'teamA' LIMIT 1
SELECT "servers".* FROM "servers" WHERE "servers"."domain_id" = 1
---
	def put_file
		up_file = params[:upload]
		name = params[:name]
		domain = Domain.find_by_name params[:domain]
		user = User.find_by_remember_token(cookies[:remember_token])
		puts "================ Writing file to local directory ====================="
		path = File.join("data/upload", name)
		File.open(path, "wb") { |f| f.write(up_file.read) }
		if $client.nil?
			redirect_to '/files' and return
		else
			redirect_to '/files/' + domain.name
		end
		server_list = []
		domain.servers.each do |serv|