the_final_folder/website/app/controllers/files_controller.rb

	def delete
		name = params[:id]
		domain = Domain.find_by_name params[:domain]
		user = User.find_by_remember_token(cookies[:remember_token])
---
SELECT "domains".* FROM "domains" WHERE "domains"."name" = 'localhost' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."remember_token" = 'teamA' LIMIT 1