the_final_folder/website/app/controllers/servers_controller.rb

SELECT "servers".* FROM "servers"
---
  def index
    @servers = Server.all

SELECT "servers".* FROM "servers" WHERE "servers"."id" = 1 LIMIT 1
---
  def show
    @server = Server.find(params[:id])

SELECT "servers".* FROM "servers" WHERE "servers"."id" = 4 LIMIT 1
---
  def edit
    @server = Server.find(params[:id])

SELECT "domains".* FROM "domains" WHERE "domains"."name" = 'localhost' LIMIT 1
INSERT INTO "servers" ("created_at", "domain_id", "domain_name", "ip", "updated_at") VALUES ('2012-12-09 22:59:11.759000', 1, 'localhost', '127.0.0.1', '2012-12-09 22:59:11.759000')
---
  def create
    domain = Domain.find_by_name(params[:server][:domain_name])
    params[:server][:domain_id] = domain.id
    @server = Server.new(params[:server])

    respond_to do |format|
      if @server.save

SELECT "servers".* FROM "servers" WHERE "servers"."id" = 3 LIMIT 1
UPDATE "servers" SET "ip" = '192.168.217.143', "updated_at" = '2012-12-10 22:27:36.973000' WHERE "servers"."id" = 3
---
  def update
    @server = Server.find(params[:id])

    respond_to do |format|
      if @server.update_attributes(params[:server])

SELECT "servers".* FROM "servers" WHERE "servers"."id" = 1 LIMIT 1
DELETE FROM "servers" WHERE "servers"."id" = 1
---
  def destroy
    @server = Server.find(params[:id])
    @server.destroy