the_final_folder/website/app/controllers/sessions_controller.rb

	def new
		user = User.find_by_remember_token(cookies[:remember_token])
---
SELECT "users".* FROM "users" WHERE "users"."remember_token" = 'teamA' LIMIT 1

	def create
	 	user = User.find_by_name(params[:session][:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'teat' LIMIT 1