the_final_folder/website/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password", "remember_token", "updated_at", "userhash") VALUES ('2012-12-09 01:23:56.980000', 'teamA', 'teamA', NULL, '2012-12-09 01:23:56.980000', NULL)
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1
UPDATE "users" SET "password" = 'teamA', "updated_at" = '2012-12-11 01:28:35.974000' WHERE "users"."id" = 6
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])